src/cf/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/ЕдиницыИзмерения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>ЕдиницыИзмерения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
				<xr:Item>Catalog.НоменклатурныеГруппы</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЕдиницаПоКлассификатору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесНетто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Высота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Владелец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизиты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/Качество.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>Качество</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Владелец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизиты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ХарактеристикиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>ХарактеристикиНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Владелец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизиты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/СерииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>СерииНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сертификат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокГодности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерГТД</Name>
					<Comment>Номер ГТД по умолчанию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаПроисхождения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеИзображение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРазделаГТД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Владелец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизиты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/Штрихкоды/Forms/ФормаЗаполнения/Ext/Form/Module.bsl
&НаСервере
Функция СформироватьТекстЗапроса()
	ТекстЗапроса="
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ном.*
	|ИЗ
	|	(
	|ВЫБРАТЬ
	|	СпрНоменклатура.Ссылка КАК Номенклатура,
	|";

	Если ИспользоватьЕдиницыИзмерения Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|	ЕСТЬNULL(СпрЕдиницы.Ссылка, ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)) КАК ЕдиницаИзмерения,
		|";
	Иначе
		ТекстЗапроса = ТекстЗапроса + "
		|	СпрНоменклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения,
		|";
	КонецЕсли;

	Если ИспользоватьКачество Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|	СпрКачество.Ссылка КАК Качество,
		|";
	Иначе
		ТекстЗапроса = ТекстЗапроса + "
		|	ЗНАЧЕНИЕ(Справочник.Качество.Новый) КАК Качество,
		|";
	КонецЕсли;

	Если ИспользоватьХарактеристики Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|	ЕСТЬNULL(СпрХарактеристики.Ссылка, СпрНоменклатура.ХарактеристикаНоменклатуры) КАК ХарактеристикаНоменклатуры,
		|";
	Иначе
		ТекстЗапроса = ТекстЗапроса + "
		|	СпрНоменклатура.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|";
	КонецЕсли;

	Если ИспользоватьСерии Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|	ЕСТЬNULL(СпрСерии.Ссылка, СпрНоменклатура.СерияНоменклатуры) КАК СерияНоменклатуры
		|";
	Иначе
		ТекстЗапроса = ТекстЗапроса + "
		|	СпрНоменклатура.СерияНоменклатуры КАК СерияНоменклатуры
		|";
	КонецЕсли;

	ТекстЗапроса = ТекстЗапроса + "
	|ИЗ
	|	(ВЫБРАТЬ
	|		СпрНоменклатура.Ссылка КАК Ссылка,
	|		СпрНоменклатура.ЕдиницаХраненияОстатков КАК ЕдиницаХраненияОстатков,
	|		ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК ХарактеристикаНоменклатуры,
	|		ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияНоменклатуры
	|	ИЗ
	|		Справочник.Номенклатура КАК СпрНоменклатура
	|	ГДЕ
	|		НЕ СпрНоменклатура.ЭтоГруппа
	|	) КАК СпрНоменклатура
	|";

	Если ИспользоватьЕдиницыИзмерения Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	Справочник.ЕдиницыИзмерения КАК СпрЕдиницы
		|ПО
		|	СпрЕдиницы.Владелец = СпрНоменклатура.Ссылка
		|";
	КонецЕсли;

	Если ИспользоватьКачество Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	Справочник.Качество КАК СпрКачество
		|ПО
		|	СпрКачество.Ссылка = ЗНАЧЕНИЕ(Справочник.Качество.Новый)
		|	ИЛИ НЕ (СпрНоменклатура.Ссылка.Услуга
		|	Или СпрНоменклатура.Ссылка.Набор
		|	Или СпрНоменклатура.Ссылка.Комплект)
		|";
	КонецЕсли;

	Если ИспользоватьХарактеристики Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	(ВЫБРАТЬ
		|		СпрХарактеристики.Ссылка КАК Ссылка,
		|		СпрХарактеристики.Владелец КАК Владелец
		|	ИЗ
		|		Справочник.ХарактеристикиНоменклатуры КАК СпрХарактеристики
		|	ОБЪЕДИНИТЬ
		|	ВЫБРАТЬ
		|		ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
		|		NULL
		|	)КАК СпрХарактеристики
		|ПО
		|	СпрХарактеристики.Владелец = СпрНоменклатура.Ссылка
		|	ИЛИ СпрХарактеристики.Ссылка = СпрНоменклатура.ХарактеристикаНоменклатуры
		|";
	КонецЕсли;

	Если ИспользоватьСерии Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	(ВЫБРАТЬ
		|		СпрСерии.Ссылка КАК Ссылка,
		|		СпрСерии.Владелец КАК Владелец
		|	ИЗ
		|		Справочник.СерииНоменклатуры КАК СпрСерии
		|	ОБЪЕДИНИТЬ
		|	ВЫБРАТЬ
		|		ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка),
		|		NULL
		|	)КАК СпрСерии
		|ПО
		|	СпрСерии.Владелец = СпрНоменклатура.Ссылка
		|	ИЛИ СпрСерии.Ссылка = СпрНоменклатура.СерияНоменклатуры
		|";
	КонецЕсли;

	ТекстЗапроса = ТекстЗапроса + "
	|) КАК Ном
	|";

	ТекстЗапроса = ТекстЗапроса + "
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ШтрихКоды КАК ШтрихКоды
	|ПО
	|	ШтрихКоды.Владелец = Ном.Номенклатура
	|	И ШтрихКоды.ХарактеристикаНоменклатуры = Ном.ХарактеристикаНоменклатуры
	|	И ШтрихКоды.СерияНоменклатуры = Ном.СерияНоменклатуры
	|	И ШтрихКоды.ЕдиницаИзмерения = Ном.ЕдиницаИзмерения
	|	И ШтрихКоды.Качество = Ном.Качество
	|";

	Если ТолькоИмеющиесяВНаличии Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	(ВЫБРАТЬ
		|		РегТоварыНаСкладах.Номенклатура КАК Номенклатура,
		|		РегТоварыНаСкладах.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|		РегТоварыНаСкладах.СерияНоменклатуры КАК СерияНоменклатуры,
		|		РегТоварыНаСкладах.Качество КАК Качество,
		|		РегТоварыНаСкладах.КоличествоОстаток КАК Количество
		|	ИЗ
		|		РегистрНакопления.ПартииТоваровНаСкладах.Остатки(, ) КАК РегТоварыНаСкладах
		|	) КАК Остатки
		|ПО
		|	Остатки.Номенклатура = Ном.Номенклатура
		|	И Остатки.ХарактеристикаНоменклатуры = Ном.ХарактеристикаНоменклатуры
		|	И Остатки.СерияНоменклатуры = Ном.СерияНоменклатуры
		|	И Остатки.Качество = Ном.Качество
		|ГДЕ
		|	(ЕСТЬNULL(Остатки.Количество, 0) > 0
		|	ИЛИ Ном.Номенклатура.Услуга)
		|	И ШтрихКоды.Качество ЕСТЬ NULL
		//|	И Не Ном.Номенклатура.Набор
		|	И Не Ном.Номенклатура.Весовой
		|";
	Иначе
		ТекстЗапроса = ТекстЗапроса + "
		|ГДЕ
		|	ШтрихКоды.Качество ЕСТЬ NULL
		//|	И Не Ном.Номенклатура.Набор
		|	И Не Ном.Номенклатура.Весовой
		|";
	КонецЕсли;

	Возврат ТекстЗапроса;
КонецФункции

&НаКлиенте
Процедура Заполнить(Команда)
	СозданоНовых=ЗаполнитьНаСервере();
	ПоказатьПредупреждение(,"Создано " + СокрЛП(СозданоНовых)+" новых записей.");
КонецПроцедуры

&НаСервере
Функция ЗаполнитьНаСервере()
	дзДанные=Новый ТаблицаЗначений;
	
	СхемаКомпоновкиДанных=РегистрыСведений.Штрихкоды.ПолучитьМакет("СКД");
	СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Запрос=СформироватьТекстЗапроса();

	КомпоновщикМакета=Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки=КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
	ПроцессорКомпоновкиДанных=Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода=Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(дзДанные);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	ТипEAN13 = ПланыВидовХарактеристик.ТипыШтрихкодов.EAN13;
	ПрефиксШтучногоТовара = СокрЛП(Константы.ПрефиксШтучногоТовара.Получить());
	ПрефиксВнутреннегоШтрихкода = Константы.ПрефиксВнутреннегоШтрихкода.Получить();

	НаборЗаписей = РегистрыСведений.Штрихкоды.СоздатьНаборЗаписей();

	СозданоНовых = 0;

	Для каждого СтрокаКоллекции Из дзДанные Цикл
		НаборЗаписей.Очистить();

		НоваяСтрока=НаборЗаписей.Добавить();
		НоваяСтрока.ТипШтрихкода               = ТипEAN13;
		НоваяСтрока.Штрихкод                   = УправлениеРозничнойТорговлейСервер.СформироватьШтрихКод(ПрефиксШтучногоТовара, ПрефиксВнутреннегоШтрихкода);
		НоваяСтрока.Владелец                   = СтрокаКоллекции.Номенклатура;
		НоваяСтрока.ЕдиницаИзмерения           = СтрокаКоллекции.ЕдиницаИзмерения;
		НоваяСтрока.СерияНоменклатуры          = СтрокаКоллекции.СерияНоменклатуры;
		НоваяСтрока.ХарактеристикаНоменклатуры = СтрокаКоллекции.ХарактеристикаНоменклатуры;
		НоваяСтрока.Качество                   = СтрокаКоллекции.Качество;
		
		НаборЗаписей.Отбор.ТипШтрихкода.Установить(НоваяСтрока.ТипШтрихкода);
		НаборЗаписей.Отбор.Штрихкод.Установить(НоваяСтрока.Штрихкод);
		НаборЗаписей.Отбор.Владелец.Установить(НоваяСтрока.Владелец);
		НаборЗаписей.Отбор.ЕдиницаИзмерения.Установить(НоваяСтрока.ЕдиницаИзмерения);
		НаборЗаписей.Отбор.СерияНоменклатуры.Установить(НоваяСтрока.СерияНоменклатуры);
		НаборЗаписей.Отбор.ХарактеристикаНоменклатуры.Установить(НоваяСтрока.ХарактеристикаНоменклатуры);
		НаборЗаписей.Отбор.Качество.Установить(НоваяСтрока.Качество);

		НаборЗаписей.Записать();

		СозданоНовых = СозданоНовых + 1;
	КонецЦикла;

	Возврат СозданоНовых;	
КонецФункции

&НаСервере
Процедура Инициализация()
	СхемаКомпоновкиДанных=РегистрыСведений.Штрихкоды.ПолучитьМакет("СКД");
	СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Запрос=СформироватьТекстЗапроса();

	URLСхемы=ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор());

	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(URLСхемы));
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий атрибутов

&НаКлиенте
Процедура Атрибут_ПриИзменении(Элемент)
	Инициализация();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ИспользоватьХарактеристики.Доступность=Константы.ИспользоватьХарактеристикиНоменклатуры.Получить();
	Элементы.ИспользоватьСерии.Доступность=Константы.ИспользоватьСерииНоменклатуры.Получить();
	Инициализация();
КонецПроцедуры
